tutorials/pnpFoam/infiniteChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-6;//1e-6;

vertices
(
    (0 0 0)
    (5 0 0)
    (5 1 0)
    (0 1 0)
    (0 0 0.1)
    (5 0 0.1)
    (5 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 320 1)
    simpleGrading
    (
		1
        1
        1
    )
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }


    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 4 7 3)
        );
    }
    
    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (2 6 5 1)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
