tutorials/pnpFoam/infiniteChannel/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0]; // As pnpFoam is using normal pressure NOT kinematic pressure, currently

refPValue 0; // Reference pressure value

internalField   uniform 0;

boundaryField
{
    top
    {
        type            fixedValue;
        value           uniform $refPValue;
    }

    bottom
    {
        type            zeroGradient;
    }
    
    inlet
    {
        type            cyclic;//fixedJump;
        patchType       cyclic;
        jump            uniform 1e-7;
    }

    outlet
    {
        type            cyclic;//fixedJump;
        patchType       cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
