tutorials/pnpFoam/infiniteChannel/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    top
    {
        type        fixedValue;
        value       $internalField;
    }

    bottom
    {
        type        fixedValue;
        value       $internalField;
    }

    inlet
    {
        type        cyclic;
    }

    outlet
    {
        type        cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
