tutorials/pnpFoam/infiniteChannel/0/V
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;//1e-3;

boundaryField
{
    top
    {
        type        fixedValue;
        value       uniform 0.05;
    }

    bottom
    {
        type        fixedValue;
        value       uniform 0;
    }

    inlet
    {
        type        cyclic;
    }

    outlet
    {
        type        cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
