tutorials/pnpFoam/infiniteChannel/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// pressureGradient
// {
//     type            vectorSemiImplicitSource;
//     active          yes;
//     selectionMode   all;

//     volumeMode      absolute;//specific;

//     injectionRateSuSp
//     {
//         //- Syntax
//         //  fieldName   (Su Sp)
        
//         U           ((5e-6 0 0)  0); //1e+13
//     }
// }
meanVelocityForce1
    {
        // Mandatory entries (unmodifiable)
        type                 meanVelocityForce;

        // Mandatory entries (unmodifiable)
        Ubar             (0.083333333 0 0);

        selectionMode       all;

        fields              (U);

        // Optional entries (unmodifiable)
        relaxation       1.0;
    }
// ************************************************************************* //
