tutorials/pnpFoam/infiniteChannel/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

start   (2.5e-06 0 5e-08);
end     (2.5e-06 1e-06 5e-08);
fields  (C.anions p U V);

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

// Override settings here, e.g.

interpolationScheme cellPointFace;

//setFormat   raw;

setConfig
{
    type lineUniform;
    axis distance;        // y, z, xyz
    nPoints 1000;
}


// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"

// ************************************************************************* //
